---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Extrusion
source: html/48a58213-2c3b-e2c0-81a5-0051d8ea7222.htm
---
# Extrusion Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.